project_4/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:spel="http://speller.yandex.net/services/spellservice">
   <soapenv:Header/>
   <soapenv:Body>
      <spel:CheckTextsRequest lang="ru" options="0" format="">
         <!--Zero or more repetitions:-->
         <spel:text>шо опять?</spel:text>
           <spel:text>што делаешъ?</spel:text>
		<spel:text>ти доме?</spel:text>
		<spel:text>кешать будашь?</spel:text>
		<spel:text>лол, кек</spel:text>

      </spel:CheckTextsRequest>
   </soapenv:Body>
</soapenv:Envelope>