checkTextRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:spel="http://speller.yandex.net/services/spellservice">
   <soapenv:Header/>
   <soapenv:Body>
      <spel:CheckTextRequest lang="EN" options="0" format="">
         <spel:text>aplication</spel:text>
      </spel:CheckTextRequest>
   </soapenv:Body>
</soapenv:Envelope>